# 2078 : 무한이진트리
'''
                     (1,1)
             /                  \ 
         (2,1)                   (1,2)
        /     \                 /     \ 
   (3,1)       (2,3)       (3,2)       (1,3)
  /     \     /     \     /     \     /     \ 
(4,1)|(3,4)|(5,3) (2,5) (5,2) (3,5) (4,3) (1,4)
'''

a, b = map(int, input().split())
r = 0
l = 0

while a>1 and b>1:
    if a > b:
        # l += 1
        # a -= b
        l += a//b
        a %= b    # a를 부모노드 값으로
                  # a+b에서 b를 빼는거나..
                  # 몫은 어차피 left 이동 횟수니까 나머지를 더하는거나..
    else:
        # r += 1
        # b -= a
        r += b//a
        b %= a

# print(a,b)  # 한 쪽이 1이 돼서 while 멈췄음
l += a - 1
r += b -1
print(l, r)